Public Attributes | List of all members
API_EdgeTrim Struct Reference
Element Manager API
Describes the parameters of a roof or slab edge. In previous API versions this structure used to be called API_RoofSide. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_EdgeTrimID  | sideType
The trim type of the edge (see API_EdgeTrimID).
double  | sideAngle
The angle of the edge trim in radians in case of custom trim types.
Detailed Description
Describes the parameters of a roof or slab edge. In previous API versions this structure used to be called API_RoofSide.
Member Data Documentation
◆ sideAngle
 API_EdgeTrim::sideAngle
The angle of the edge trim in radians in case of custom trim types.
◆ sideType
 API_EdgeTrim::sideType
The trim type of the edge (see API_EdgeTrimID).